In [13]:
import pandas as pd #
import numpy as np  # Random() function used later
n=1000
df=pd.DataFrame({
    "Student_ID": np.arange(101, 101+n),
    "Age": np.random.randint(18, 24,size=n),
    "Marks": np.random.randint(50, 100,size=n),
    "Department": np.random.choice(["AIML", "ECE", "ME", "CSE", "AR"], size=n)
})

In [14]:
# Introduce Missing Values in Age, Marks, Department
for col in["Age", "Marks", "Department"]:
    df.loc[df.sample(frac=0.05).index, col] = np.nan  # Introduce 5% missing values
df

     Student_ID   Age  Marks Department
0           101  22.0   58.0        NaN
1           102  22.0   94.0         AR
2           103  22.0   83.0         ME
3           104  20.0   52.0        ECE
4           105  22.0   79.0        NaN
..          ...   ...    ...        ...
995        1096  20.0   62.0        ECE
996        1097  22.0   75.0         AR
997        1098  18.0   64.0        ECE
998        1099  21.0   84.0       AIML
999        1100  21.0   79.0       AIML

[1000 rows x 4 columns]

In [15]:
#Introdece Duplicate records/Rows
pd.concat([df, df.sample(20)], ignore_index=True) # Duplicate 20 random rows

#Introduce invalid ages
df.loc[df.sample(10).index, "Age"] = np.random.choice([-5, 240], size=10)  
df

     Student_ID   Age  Marks Department
0           101  22.0   58.0        NaN
1           102  22.0   94.0         AR
2           103  22.0   83.0         ME
3           104  20.0   52.0        ECE
4           105  22.0   79.0        NaN
..          ...   ...    ...        ...
995        1096  20.0   62.0        ECE
996        1097  22.0   75.0         AR
997        1098  18.0   64.0        ECE
998        1099  21.0   84.0       AIML
999        1100  21.0   79.0       AIML

[1000 rows x 4 columns]

In [16]:
# Inconsistent Text Formatting
df["Department"] = df["Department"].astype(str)
df.loc[df.sample(frac=0.1).index, "Department"] = df["Department"].sample(10).str.lower()
df

     Student_ID   Age  Marks Department
0           101  22.0   58.0        nan
1           102  22.0   94.0        NaN
2           103  22.0   83.0         ME
3           104  20.0   52.0        ECE
4           105  22.0   79.0        nan
..          ...   ...    ...        ...
995        1096  20.0   62.0        ECE
996        1097  22.0   75.0         AR
997        1098  18.0   64.0        NaN
998        1099  21.0   84.0       AIML
999        1100  21.0   79.0       AIML

[1000 rows x 4 columns]

In [19]:
df=df.copy()
df.columns.str.strip()#Making Standarised Column
df.columns.str.lower()

Index(['student_id', 'age', 'marks', 'department'], dtype='object')

In [18]:
df.columns.str.replace(" " ,"_")

Index(['Student_ID', 'Age', 'Marks', 'Department'], dtype='object')

In [ ]:
#Enforcing Correct Data type
df["age"]=pd.to_numeric(df["age"], errors="coerce")